In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame, Series

## Data Filteration & Selection

In [10]:
df = pd.DataFrame(np.arange(0, 90,3).reshape(10,3), index = [f'row {i}' for i in range(1, 11)], columns = [f'C{i}' for i in range(1, 4)])
df

        C1  C2  C3
row 1    0   3   6
row 2    9  12  15
row 3   18  21  24
row 4   27  30  33
row 5   36  39  42
row 6   45  48  51
row 7   54  57  60
row 8   63  66  69
row 9   72  75  78
row 10  81  84  87

### Indexing

Indexing could be used to get values or set new values.  

**Methods of indexing:**
- **Normal**  
- **Boolean**

#### Normal

for single value: dataframe.iloc[row, column]  

for multiple values: dataframe.iloc[[row1, row2, ..], [col1, col2, col3, ...]]

In [15]:
df.iloc[0, 2]

np.int64(6)

In [16]:
df.iloc[0, 2] = 55
df

        C1  C2  C3
row 1    0   3  55
row 2    9  12  15
row 3   18  21  24
row 4   27  30  33
row 5   36  39  42
row 6   45  48  51
row 7   54  57  60
row 8   63  66  69
row 9   72  75  78
row 10  81  84  87

In [18]:
df.iloc[[2,6,8],[0,1]]

       C1  C2
row 3  18  21
row 7  54  57
row 9  72  75

In [36]:
#whole row
df.iloc[0, :]

C1     0
C2     3
C3    55
Name: row 1, dtype: int64

In [38]:
#whole column
df.iloc[:,0]

row 1      0
row 2      9
row 3     18
row 4     27
row 5     36
row 6     45
row 7     55
row 8     63
row 9     72
row 10    81
Name: C1, dtype: int64

#### Boolean

Uses comparison operators and masking to filter the dataframe.

Using the operators, a boolean dataframe is returned which is used as a mask.

In [19]:
df>20

           C1     C2     C3
row 1   False  False   True
row 2   False  False  False
row 3   False   True   True
row 4    True   True   True
row 5    True   True   True
row 6    True   True   True
row 7    True   True   True
row 8    True   True   True
row 9    True   True   True
row 10   True   True   True

In [25]:
df[df>20]

          C1    C2    C3
row 1    NaN   NaN  55.0
row 2    NaN   NaN   NaN
row 3    NaN  21.0  24.0
row 4   27.0  30.0  33.0
row 5   36.0  39.0  42.0
row 6   45.0  48.0  51.0
row 7   54.0  57.0  60.0
row 8   63.0  66.0  69.0
row 9   72.0  75.0  78.0
row 10  81.0  84.0  87.0

In [31]:
df[(df>50) & (df<60)]

          C1    C2    C3
row 1    NaN   NaN  55.0
row 2    NaN   NaN   NaN
row 3    NaN   NaN   NaN
row 4    NaN   NaN   NaN
row 5    NaN   NaN   NaN
row 6    NaN   NaN  51.0
row 7   54.0  57.0   NaN
row 8    NaN   NaN   NaN
row 9    NaN   NaN   NaN
row 10   NaN   NaN   NaN

In [32]:
df[(df>50) & (df<60)] = 55
df

        C1  C2  C3
row 1    0   3  55
row 2    9  12  15
row 3   18  21  24
row 4   27  30  33
row 5   36  39  42
row 6   45  48  55
row 7   55  55  60
row 8   63  66  69
row 9   72  75  78
row 10  81  84  87

# Data Preparation

## Missing Values

In [59]:
data = {'Name': ['A', 'AA', 'B', 'D', 'R', 'MT', 'MA'],
        'Age': [20, 20, 19, 23, 26, 22, 19],
        'Gender': ['M', 'F', 'F', 'M', 'M', 'F', 'M'],
        'Rank': [5, 8, 7, 9, 7, 8, 7]}

data = DataFrame(data)
data

  Name  Age Gender  Rank
0    A   20      M     5
1   AA   20      F     8
2    B   19      F     7
3    D   23      M     9
4    R   26      M     7
5   MT   22      F     8
6   MA   19      M     7

In [60]:
data.iloc[2:4,1] = np.nan
data.iloc[1:3,3] = np.nan
data.loc[7] = [np.nan, np.nan, np.nan, np.nan]

data

  Name   Age Gender  Rank
0    A  20.0      M   5.0
1   AA  20.0      F   NaN
2    B   NaN      F   NaN
3    D   NaN      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0
7  NaN   NaN    NaN   NaN

### Viewing nulls

In [61]:
#Checking for missing values

data.isnull()

    Name    Age  Gender   Rank
0  False  False   False  False
1  False  False   False   True
2  False   True   False   True
3  False   True   False  False
4  False  False   False  False
5  False  False   False  False
6  False  False   False  False
7   True   True    True   True

In [62]:
data.isnull().sum()

Name      1
Age       3
Gender    1
Rank      3
dtype: int64

In [63]:
# to get any row with null
data[data.isnull().any(axis=1)]

  Name   Age Gender  Rank
1   AA  20.0      F   NaN
2    B   NaN      F   NaN
3    D   NaN      M   9.0
7  NaN   NaN    NaN   NaN

In [64]:
# to get for certain column
data[data['Age'].isnull()]

  Name  Age Gender  Rank
2    B  NaN      F   NaN
3    D  NaN      M   9.0
7  NaN  NaN    NaN   NaN

### Some useful operations:

In [65]:
data.describe()

             Age     Rank
count   5.000000  5.00000
mean   21.400000  7.20000
std     2.792848  1.48324
min    19.000000  5.00000
25%    20.000000  7.00000
50%    20.000000  7.00000
75%    22.000000  8.00000
max    26.000000  9.00000

For numerical features, getting values such as( mean, std, max...) helps in exploring the data and aids in deciding how to fill the NANs.

In [ ]:
data.value_counts() #returns as whole row

Name  Age   Gender  Rank
A     20.0  M       5.0     1
MA    19.0  M       7.0     1
MT    22.0  F       8.0     1
R     26.0  M       7.0     1
Name: count, dtype: int64

In [67]:
data['Gender'].value_counts()

Gender
M    4
F    3
Name: count, dtype: int64

In [68]:
data.mode()

  Name   Age Gender  Rank
0    A  20.0      M   7.0
1   AA   NaN    NaN   NaN
2    B   NaN    NaN   NaN
3    D   NaN    NaN   NaN
4   MA   NaN    NaN   NaN
5   MT   NaN    NaN   NaN
6    R   NaN    NaN   NaN

For columns with no mode, all values will be displayed.

In [69]:
data['Age'].mode()

0    20.0
Name: Age, dtype: float64

In [70]:
for col in data.columns:
    print(col,':\n', data[col].mode())

Name :
 0     A
1    AA
2     B
3     D
4    MA
5    MT
6     R
Name: Name, dtype: object
Age :
 0    20.0
Name: Age, dtype: float64
Gender :
 0    M
Name: Gender, dtype: object
Rank :
 0    7.0
Name: Rank, dtype: float64

In [71]:
data['Gender'].unique()

array(['M', 'F', nan], dtype=object)

### Filling

In [73]:
data

  Name   Age Gender  Rank
0    A  20.0      M   5.0
1   AA  20.0      F   NaN
2    B   NaN      F   NaN
3    D   NaN      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0
7  NaN   NaN    NaN   NaN

In [79]:
data['Age'].fillna(int(data['Age'].mean()))

0    20.0
1    20.0
2    21.0
3    21.0
4    26.0
5    22.0
6    19.0
7    21.0
Name: Age, dtype: float64

In [81]:
#Notice change was not saved
data

  Name   Age Gender  Rank
0    A  20.0      M   5.0
1   AA  20.0      F   NaN
2    B   NaN      F   NaN
3    D   NaN      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0
7  NaN   NaN    NaN   NaN

In [83]:
data['Age'].fillna(int(data['Age'].mean()), inplace=True)
data

  Name   Age Gender  Rank
0    A  20.0      M   5.0
1   AA  20.0      F   NaN
2    B  21.0      F   NaN
3    D  21.0      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0
7  NaN  21.0    NaN   NaN

In [85]:
#fills with prior value
data.fillna(method='pad')

/tmp/ipykernel_6300/3135516794.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='pad')

  Name   Age Gender  Rank
0    A  20.0      M   5.0
1   AA  20.0      F   5.0
2    B  21.0      F   5.0
3    D  21.0      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0
7   MA  21.0      M   7.0

In [87]:
#fills with next value
data.fillna(method='bfill')

/tmp/ipykernel_6300/3769114947.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill')

  Name   Age Gender  Rank
0    A  20.0      M   5.0
1   AA  20.0      F   9.0
2    B  21.0      F   9.0
3    D  21.0      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0
7  NaN  21.0    NaN   NaN

In [88]:
#interpolation

data.interpolate(method='linear')

/tmp/ipykernel_6300/1121589562.py:3: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  data.interpolate(method='linear')

  Name   Age Gender      Rank
0    A  20.0      M  5.000000
1   AA  20.0      F  6.333333
2    B  21.0      F  7.666667
3    D  21.0      M  9.000000
4    R  26.0      M  7.000000
5   MT  22.0      F  8.000000
6   MA  19.0      M  7.000000
7  NaN  21.0    NaN  7.000000

In [90]:
#dropping

data.dropna()

  Name   Age Gender  Rank
0    A  20.0      M   5.0
3    D  21.0      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0

In [111]:
#dropping rows with all nulls
data.iloc[7,1] = np.nan

data.dropna(how='all')

  Name   Age Gender  Rank
0    A  20.0      M   5.0
1   AA  20.0      F   NaN
2    B  21.0      F   NaN
3    D  21.0      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0

In [112]:
#dropping rows with more than 2 nulls

data.loc[data.isna().sum(axis=1)>2]

  Name  Age Gender  Rank
7  NaN  NaN    NaN   NaN

In [113]:
data.drop((data.loc[data.isna().sum(axis=1)>2]).index)

  Name   Age Gender  Rank
0    A  20.0      M   5.0
1   AA  20.0      F   NaN
2    B  21.0      F   NaN
3    D  21.0      M   9.0
4    R  26.0      M   7.0
5   MT  22.0      F   8.0
6   MA  19.0      M   7.0

## Duplicates

In [2]:
data_dup = DataFrame({'Col1' : [np.random.randint(10) for i in range(20)],
                      'Col2': [['a', 'b', 'c'][np.random.randint(3)] for i in range(20)],
                      'Col3': [['I', 'II', 'III'][np.random.randint(3)] for i in range(20)]})

data_dup

    Col1 Col2 Col3
0      2    a   II
1      2    a  III
2      2    a    I
3      6    c    I
4      2    b    I
5      6    c  III
6      0    c    I
7      3    a   II
8      2    c    I
9      7    a  III
10     4    c    I
11     3    a    I
12     5    b   II
13     0    b  III
14     5    a    I
15     3    b  III
16     2    b  III
17     4    c    I
18     9    c    I
19     3    b   II

In [3]:
data_dup.duplicated() #checks if there is a duplicated row

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17     True
18    False
19    False
dtype: bool

In [4]:
data_dup['Col1'].duplicated() #Checks per column only

0     False
1      True
2      True
3     False
4      True
5      True
6     False
7     False
8      True
9     False
10    False
11     True
12    False
13     True
14     True
15     True
16     True
17     True
18    False
19     True
Name: Col1, dtype: bool

In [ ]:
data_dup.drop_duplicates(['Col1']) #drops rows having duplicated from Col1 only

    Col1 Col2 Col3
0      2    a   II
3      6    c    I
6      0    c    I
7      3    a   II
9      7    a  III
10     4    c    I
12     5    b   II
18     9    c    I

In [6]:
data_dup.drop_duplicates()

    Col1 Col2 Col3
0      2    a   II
1      2    a  III
2      2    a    I
3      6    c    I
4      2    b    I
5      6    c  III
6      0    c    I
7      3    a   II
8      2    c    I
9      7    a  III
10     4    c    I
11     3    a    I
12     5    b   II
13     0    b  III
14     5    a    I
15     3    b  III
16     2    b  III
18     9    c    I
19     3    b   II

## Concatenating

In [2]:
data_concat1  = DataFrame(np.arange(36).reshape(6,6))
data_concat1

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [3]:
data_concat2  = DataFrame(np.arange(15).reshape(5,3))
data_concat2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [7]:
pd.concat([data_concat1, data_concat2], axis=1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [9]:
pd.concat([data_concat1, data_concat2], axis=0)

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

In [ ]:
pd.concat([data_concat1, data_concat2]) #default is axis=0

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

## Transforming

Includes dropping, adding, or sorting data.

In [17]:
#dropping
data_concat1.drop(0) #drops first row

    0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [18]:
data_concat1.drop([0, 2]) #drops first and third rows

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [19]:
data_concat1.drop([0, 2], axis=1) #drops first and third columns

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

In [23]:
#Adding
add_ser = Series(np.arange(6))
add_ser

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [40]:
add_ser.name = 'newCol'
add_ser

0    0
1    1
2    2
3    3
4    4
5    5
Name: newCol, dtype: int64

In [26]:
data_concat1.join(add_ser)

    0   1   2   3   4   5  newCol
0   0   1   2   3   4   5       0
1   6   7   8   9  10  11       1
2  12  13  14  15  16  17       2
3  18  19  20  21  22  23       3
4  24  25  26  27  28  29       4
5  30  31  32  33  34  35       5

In [31]:
#add row
data_concat1.loc[len(data_concat1)] = add_ser

In [32]:
data_concat1

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35
6   0   1   2   3   4   5

In [34]:
pd.concat([data_concat1, data_concat1])

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35
6   0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35
6   0   1   2   3   4   5

In [ ]:
pd.concat([data_concat1, data_concat1], ignore_index = True) #sets new index

     0   1   2   3   4   5
0    0   1   2   3   4   5
1    6   7   8   9  10  11
2   12  13  14  15  16  17
3   18  19  20  21  22  23
4   24  25  26  27  28  29
5   30  31  32  33  34  35
6    0   1   2   3   4   5
7    0   1   2   3   4   5
8    6   7   8   9  10  11
9   12  13  14  15  16  17
10  18  19  20  21  22  23
11  24  25  26  27  28  29
12  30  31  32  33  34  35
13   0   1   2   3   4   5

In [43]:
new_data = data_concat1.join(add_ser)
new_data

    0   1   2   3   4   5  newCol
0   0   1   2   3   4   5     0.0
1   6   7   8   9  10  11     1.0
2  12  13  14  15  16  17     2.0
3  18  19  20  21  22  23     3.0
4  24  25  26  27  28  29     4.0
5  30  31  32  33  34  35     5.0
6   0   1   2   3   4   5     NaN

In [52]:
#Sorting
new_data.sort_values(by=[3]) #sorts by column 3

    0   1   2   3   4   5  newCol
0   0   1   2   3   4   5     0.0
6   0   1   2   3   4   5     NaN
1   6   7   8   9  10  11     1.0
2  12  13  14  15  16  17     2.0
3  18  19  20  21  22  23     3.0
4  24  25  26  27  28  29     4.0
5  30  31  32  33  34  35     5.0

In [56]:
new_data.loc[len(new_data)] = [0,1,2,3,4,5,6]
new_data.sort_values(by=[3,'newCol']) #sorts by column 3 then newCol

    0   1   2   3   4   5  newCol
0   0   1   2   3   4   5     0.0
7   0   1   2   3   4   5     6.0
6   0   1   2   3   4   5     NaN
1   6   7   8   9  10  11     1.0
2  12  13  14  15  16  17     2.0
3  18  19  20  21  22  23     3.0
4  24  25  26  27  28  29     4.0
5  30  31  32  33  34  35     5.0

In [58]:
new_data.sort_values(by=['newCol'])

    0   1   2   3   4   5  newCol
0   0   1   2   3   4   5     0.0
1   6   7   8   9  10  11     1.0
2  12  13  14  15  16  17     2.0
3  18  19  20  21  22  23     3.0
4  24  25  26  27  28  29     4.0
5  30  31  32  33  34  35     5.0
7   0   1   2   3   4   5     6.0
6   0   1   2   3   4   5     NaN

In [ ]:
new_data.sort_values(by=[3,'newCol'], ascending=[True, False]) #by default True

    0   1   2   3   4   5  newCol
7   0   1   2   3   4   5     6.0
0   0   1   2   3   4   5     0.0
6   0   1   2   3   4   5     NaN
1   6   7   8   9  10  11     1.0
2  12  13  14  15  16  17     2.0
3  18  19  20  21  22  23     3.0
4  24  25  26  27  28  29     4.0
5  30  31  32  33  34  35     5.0

## Grouping

In [31]:
df = pd.DataFrame({'Id':[i for i in range(30)], 
                   'Name':['A'*(12%i+1) for i in range(1,11)]+['B'*(12%i+1) for i in range(1,11)]+ ['C'*(12%i+1) for i in range(1,11)],
                   'Color':[['Red', 'Blue', 'Black'][np.random.randint(3)] for i in range(30)], 
                   'Code':[chr(np.random.randint(65, 95)) for i in range(30)],
                   'Score':[np.random.randint(10)*np.random.randint(50, 80) for i in range(30)]})

df

    Id    Name  Color Code  Score
0    0       A  Black    C    345
1    1       A   Blue    I    260
2    2       A   Blue    F    513
3    3       A    Red    Z    336
4    4     AAA   Blue    C    639
5    5       A    Red    W    265
6    6  AAAAAA  Black    W    232
7    7   AAAAA   Blue    F     65
8    8    AAAA  Black    A    195
9    9     AAA    Red    W    216
10  10       B    Red    R     77
11  11       B   Blue    A    576
12  12       B  Black    X    306
13  13       B    Red    O      0
14  14     BBB    Red    C    335
15  15       B  Black    ^    540
16  16  BBBBBB   Blue    L    310
17  17   BBBBB    Red    K    536
18  18    BBBB   Blue    O    171
19  19     BBB   Blue    N    552
20  20       C    Red    F    126
21  21       C    Red    B      0
22  22       C  Black    B    496
23  23       C  Black    T    413
24  24     CCC  Black    T    110
25  25       C   Blue    [    432
26  26  CCCCCC  Black    V    408
27  27   CCCCC   Blue    F    472
28  28    CCCC   Blue    I    513
29  29     CCC   Blue    A    497

In [32]:
df.groupby(df['Color']).mean(numeric_only=True)

              Id       Score
Color
Black  15.111111  338.333333
Blue   15.583333  416.666667
Red    12.444444  210.111111

In [33]:
df.groupby(df['Color']).sum(numeric_only=True)

        Id  Score
Color
Black  136   3045
Blue   187   5000
Red    112   1891

In [36]:
df.groupby(df['Color']).count()

       Id  Name  Code  Score
Color
Black   9     9     9      9
Blue   12    12    12     12
Red     9     9     9      9

In [42]:
help(df.groupby)

Help on method groupby in module pandas.core.frame:

groupby(by=None, axis: 'Axis | lib.NoDefault' = <no_default>, level: 'IndexLabel | None' = None, as_index: 'bool' = True, sort: 'bool' = True, group_keys: 'bool' = True, observed: 'bool | lib.NoDefault' = <no_default>, dropna: 'bool' = True) -> 'DataFrameGroupBy' method of pandas.core.frame.DataFrame instance
    Group DataFrame using a mapper or by a Series of columns.

    A groupby operation involves some combination of splitting the
    object, applying a function, and combining the results. This can be
    used to group large amounts of data and compute operations on these
    groups.

    Parameters
    ----------
    by : mapping, function, label, pd.Grouper or list of such
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If a list or ndarray of length
        equal to the selected axis is passed (see the `groupby user guide
        <https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#splitting-an-object-into-groups>`_),
        the values are used as-is to determine the groups. A label or list
        of labels may be passed to group by the columns in ``self``.
        Notice that a tuple is interpreted as a (single) key.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Split along rows (0) or columns (1). For `Series` this parameter
        is unused and defaults to 0.

        .. deprecated:: 2.1.0

            Will be removed and behave like axis=0 in a future version.
            For ``axis=1``, do ``frame.T.groupby(...)`` instead.

    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels. Do not specify both ``by`` and ``level``.
    as_index : bool, default True
        Return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output. This argument has no effect
        on filtrations (see the `filtrations in the user guide
        <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#filtration>`_),
        such as ``head()``, ``tail()``, ``nth()`` and in transformations
        (see the `transformations in the user guide
        <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#transformation>`_).
    sort : bool, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group. Groupby preserves the order of rows within each group. If False,
        the groups will appear in the same order as they did in the original DataFrame.
        This argument has no effect on filtrations (see the `filtrations in the user guide
        <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#filtration>`_),
        such as ``head()``, ``tail()``, ``nth()`` and in transformations
        (see the `transformations in the user guide
        <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#transformation>`_).

        .. versionchanged:: 2.0.0

            Specifying ``sort=False`` with an ordered categorical grouper will no
            longer sort the values.

    group_keys : bool, default True
        When calling apply and the ``by`` argument produces a like-indexed
        (i.e. :ref:`a transform <groupby.transform>`) result, add group keys to
        index to identify pieces. By default group keys are not included
        when the result's index (and column) labels match the inputs, and
        are included otherwise.

        .. versionchanged:: 1.5.0

           Warns that ``group_keys`` will no longer be ignored when the
           result from ``apply`` is a like-indexed Series or DataFrame.
           Specify ``group_keys`` explicitly to include the group keys or
           not.

        .. versionchanged:: 2.0.0

           ``group_keys`` now defaults to ``True``.

    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. deprecated:: 2.1.0

            The default value will change to True in a future version of pandas.

    dropna : bool, default True
        If True, and if group keys contain NA values, NA values together
        with row/column will be dropped.
        If False, NA values will also be treated as the key in groups.

    Returns
    -------
    pandas.api.typing.DataFrameGroupBy
        Returns a groupby object that contains information about the groups.

    See Also
    --------
    resample : Convenience method for frequency conversion and resampling
        of time series.

    Notes
    -----
    See the `user guide
    <https://pandas.pydata.org/pandas-docs/stable/groupby.html>`__ for more
    detailed usage and examples, including splitting an object into groups,
    iterating through groups, selecting a group, aggregation, and more.

    Examples
    --------
    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0
    >>> df.groupby(['Animal']).mean()
            Max Speed
    Animal
    Falcon      375.0
    Parrot       25.0

    **Hierarchical Indexes**

    We can groupby different levels of a hierarchical index
    using the `level` parameter:

    >>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    ...           ['Captive', 'Wild', 'Captive', 'Wild']]
    >>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
    >>> df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
    ...                   index=index)
    >>> df
                    Max Speed
    Animal Type
    Falcon Captive      390.0
           Wild         350.0
    Parrot Captive       30.0
           Wild          20.0
    >>> df.groupby(level=0).mean()
            Max Speed
    Animal
    Falcon      370.0
    Parrot       25.0
    >>> df.groupby(level="Type").mean()
             Max Speed
    Type
    Captive      210.0
    Wild         185.0

    We can also choose to include NA in group keys or not by setting
    `dropna` parameter, the default setting is `True`.

    >>> l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by=["b"]).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5

    >>> df.groupby(by=["b"], dropna=False).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5
    NaN 1   4

    >>> l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by="a").sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0

    >>> df.groupby(by="a", dropna=False).sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0
    NaN 12.3   33.0

    When using ``.apply()``, use ``group_keys`` to include or exclude the
    group keys. The ``group_keys`` argument defaults to ``True`` (include).

    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df.groupby("Animal", group_keys=True)[['Max Speed']].apply(lambda x: x)
              Max Speed
    Animal
    Falcon 0      380.0
           1      370.0
    Parrot 2       24.0
           3       26.0

    >>> df.groupby("Animal", group_keys=False)[['Max Speed']].apply(lambda x: x)
       Max Speed
    0      380.0
    1      370.0
    2       24.0
    3       26.0